Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
raqvfu-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses: Refreshing state... [id=agmr-pe0lv0x63k-zwdw41-GET-200]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-pe0lv0x63k-zwdw41-GET]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-pe0lv0x63k-g9glui-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-pe0lv0x63k-btfxiy-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-pe0lv0x63k-mdthu2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-pe0lv0x63k-raqvfu-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-pe0lv0x63k-mab2tt-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-pe0lv0x63k-gkqt1f-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-pe0lv0x63k-mab2tt-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-pe0lv0x63k-gkqt1f-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-pe0lv0x63k-4giv3y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-pe0lv0x63k-vu1n7d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-pe0lv0x63k-mmed1m-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-pe0lv0x63k-930fso-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-pe0lv0x63k-mc0ha8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-pe0lv0x63k-mmed1m-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-pe0lv0x63k-5l0a2i-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-pe0lv0x63k-930fso-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-pe0lv0x63k-5l0a2i-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-pe0lv0x63k-gb7y2y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-pe0lv0x63k-skho2y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-pe0lv0x63k-mc0ha8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-pe0lv0x63k-skho2y-GET-200]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat: Read complete after 0s [id=2033607110]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-pe0lv0x63k-vu1n7d-GET-200]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp: Reading...
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp: Read complete after 0s [id=2644174252]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-pe0lv0x63k-zwdw41-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-pe0lv0x63k-4giv3y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-pe0lv0x63k-gb7y2y-POST-200]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-dbsnp:pgxflow-backend-dbsnp-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-pharmcat]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-dbsnp]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor: Read complete after 0s [id=3183881388]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPostprocessor: Refreshing state... [id=PGxFlowBackendAllowLambdaPostprocessorInvoke]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-preprocessor:pgxflow-backend-preprocessor-0]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-initLookup: Reading...
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-initLookup: Read complete after 0s [id=3266742089]
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-initLookup:pgxflow-backend-initLookup-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-preprocessor]
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-initLookup]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPharmcat: Refreshing state... [id=PGxFlowBackendAllowLambdaPharmcatInvoke]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-initPharmcat: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-initPharmcat: Read complete after 0s [id=1809317883]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-initPharmcat:pgxflow-backend-initPharmcat-0]
module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.APIInitLookup: Refreshing state... [id=AllowAPIInitLookupInvoke]
module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.LambdaDbsnp: Refreshing state... [id=PGxFlowBackendAllowDbsnpInvoke]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-initPharmcat]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.APIInitPharmcat: Refreshing state... [id=AllowAPIInitPharmcatInvoke]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPreprocessor: Refreshing state... [id=PGxFlowBackendAllowLambdaPreprocessorInvoke]
module.sbeacon.aws_api_gateway_integration_response.projects: Refreshing state... [id=agir-pe0lv0x63k-8xr1fa-GET-200]
module.pgxflow[0].aws_api_gateway_method.vcfstats-patch: Refreshing state... [id=agm-cy0g8gkrzd-b4574d-PATCH]
module.pgxflow[0].aws_api_gateway_method.vcfstats-post: Refreshing state... [id=agm-cy0g8gkrzd-b4574d-POST]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-patch: Refreshing state... [id=agm-cy0g8gkrzd-g14z9q-PATCH]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-post: Refreshing state... [id=agm-cy0g8gkrzd-g14z9q-POST]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-post: Refreshing state... [id=agm-cy0g8gkrzd-mbuauq-POST]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-get: Refreshing state... [id=agm-cy0g8gkrzd-8lebk5-GET]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-get: Refreshing state... [id=agm-cy0g8gkrzd-xbn14b-GET]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-patch: Refreshing state... [id=agm-cy0g8gkrzd-mbuauq-PATCH]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-patch: Refreshing state... [id=agi-cy0g8gkrzd-g14z9q-PATCH]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-patch: Refreshing state... [id=agmr-cy0g8gkrzd-g14z9q-PATCH-200]
module.pgxflow[0].aws_api_gateway_integration.vcfstats-patch: Refreshing state... [id=agi-cy0g8gkrzd-b4574d-PATCH]
module.pgxflow[0].aws_api_gateway_method_response.vcfstats-patch: Refreshing state... [id=agmr-cy0g8gkrzd-b4574d-PATCH-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-post: Refreshing state... [id=agmr-cy0g8gkrzd-mbuauq-POST-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-post: Refreshing state... [id=agi-cy0g8gkrzd-mbuauq-POST]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-post: Refreshing state... [id=agi-cy0g8gkrzd-g14z9q-POST]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-post: Refreshing state... [id=agmr-cy0g8gkrzd-g14z9q-POST-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-patch: Refreshing state... [id=agmr-cy0g8gkrzd-mbuauq-PATCH-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-patch: Refreshing state... [id=agi-cy0g8gkrzd-mbuauq-PATCH]
module.pgxflow[0].aws_api_gateway_integration.vcfstats-post: Refreshing state... [id=agi-cy0g8gkrzd-b4574d-POST]
module.pgxflow[0].aws_api_gateway_method_response.vcfstats-post: Refreshing state... [id=agmr-cy0g8gkrzd-b4574d-POST-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-get: Refreshing state... [id=agi-cy0g8gkrzd-xbn14b-GET]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-get: Refreshing state... [id=agi-cy0g8gkrzd-8lebk5-GET]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.results-get: Refreshing state... [id=agmr-cy0g8gkrzd-8lebk5-GET-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.results-get: Refreshing state... [id=agmr-cy0g8gkrzd-xbn14b-GET-200]
module.pgxflow[0].aws_api_gateway_integration_response.vcfstats-patch: Refreshing state... [id=agir-cy0g8gkrzd-b4574d-PATCH-200]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-cy0g8gkrzd-g14z9q-PATCH-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-post: Refreshing state... [id=agir-cy0g8gkrzd-mbuauq-POST-200]
module.pgxflow[0].aws_api_gateway_integration_response.vcfstats-post: Refreshing state... [id=agir-cy0g8gkrzd-b4574d-POST-200]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-post: Refreshing state... [id=agir-cy0g8gkrzd-g14z9q-POST-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-cy0g8gkrzd-mbuauq-PATCH-200]
module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-get: Refreshing state... [id=agir-cy0g8gkrzd-8lebk5-GET-200]
module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-get: Refreshing state... [id=agir-cy0g8gkrzd-xbn14b-GET-200]
module.pgxflow[0].aws_api_gateway_deployment.PgxApi: Refreshing state... [id=kriqu9]
module.pgxflow[0].aws_api_gateway_stage.PgxApi: Refreshing state... [id=ags-cy0g8gkrzd-prod]
module.pgxflow[0].aws_api_gateway_method_settings.PgxApi: Refreshing state... [id=cy0g8gkrzd-prod-*/*]
module.pgxflow[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2VXZGK9SBOPET]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples: Refreshing state... [id=agmr-pe0lv0x63k-mdthu2-GET-200]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-pe0lv0x63k-mdthu2-GET]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-pe0lv0x63k-mdthu2-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post: Refreshing state... [id=agmr-pe0lv0x63k-o2na61-POST-200]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-pe0lv0x63k-o2na61-POST]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-pe0lv0x63k-o2na61-POST-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=s86v8b]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-pe0lv0x63k-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=pe0lv0x63k-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2RBDI0B6VKR0G]
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=f208a0c7-1361-4b2f-8f0a-fdc1e09afec8]
module.webgui.null_resource.s3-upload: Refreshing state... [id=4043815742362835550]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E15N1ZE74H07IO]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=255632798]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=68ca2223-48d8-cb1c-1dc4-8e30dae73cfa]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=2598827130174904583]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250619023039049500000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cognito.aws_cognito_user_group.admin_group has been deleted
  - resource "aws_cognito_user_group" "admin_group" {
        id           = "ap-southeast-3_wrRXa0JGY/administrators"
      - name         = "administrators" -> null
        # (5 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user_group.manager_group has been deleted
  - resource "aws_cognito_user_group" "manager_group" {
        id           = "ap-southeast-3_wrRXa0JGY/managers"
      - name         = "managers" -> null
        # (5 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool has been deleted
  - resource "aws_cognito_user_pool" "gaspi_user_pool" {
      - arn                        = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY" -> null
      - endpoint                   = "cognito-idp.ap-southeast-3.amazonaws.com/ap-southeast-3_wrRXa0JGY" -> null
      - id                         = "ap-southeast-3_wrRXa0JGY" -> null
        name                       = "gaspi-users"
        tags                       = {
            "Environment" = "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
        # (16 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

  # module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client has changed
  ~ resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
      - id                                            = "7r8ksm03nbn0hf8ar7p86416ad" -> null
        name                                          = "gaspi-users-client"
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be updated in-place
  ~ resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
        id                               = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
        tags                             = {
            "Environment" = "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
        # (10 unchanged attributes hidden)

      - cognito_identity_providers {
          - client_id               = "7r8ksm03nbn0hf8ar7p86416ad" -> null
          - provider_name           = "cognito-idp.ap-southeast-3.amazonaws.com/ap-southeast-3_wrRXa0JGY" -> null
          - server_side_token_check = false -> null
        }
      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles will be updated in-place
  ~ resource "aws_cognito_identity_pool_roles_attachment" "gaspi_cognito_roles" {
        id               = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
        # (3 unchanged attributes hidden)

      - role_mapping {
          - ambiguous_role_resolution = "AuthenticatedRole" -> null
          - identity_provider         = "cognito-idp.ap-southeast-3.amazonaws.com/ap-southeast-3_wrRXa0JGY:7r8ksm03nbn0hf8ar7p86416ad" -> null
          - type                      = "Token" -> null
        }
      + role_mapping {
          + ambiguous_role_resolution = "AuthenticatedRole"
          + identity_provider         = (known after apply)
          + type                      = "Token"
        }
    }

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "ap-southeast-3"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "ap-southeast-3"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_group.admin_group will be created
  + resource "aws_cognito_user_group" "admin_group" {
      + description  = "Group of users who can has admin privileges"
      + id           = (known after apply)
      + name         = "administrators"
      + precedence   = 1
      + region       = "ap-southeast-3"
      + role_arn     = "arn:aws:iam::438465168484:role/gaspi-admin-group-role"
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_group.manager_group will be created
  + resource "aws_cognito_user_group" "manager_group" {
      + description  = "Group of users who can has management privileges"
      + id           = (known after apply)
      + name         = "managers"
      + precedence   = 2
      + region       = "ap-southeast-3"
      + role_arn     = "arn:aws:iam::438465168484:role/gaspi-manager-group-role"
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + region       = "ap-southeast-3"
      + user_pool_id = (known after apply)
      + username     = "admin@example.com"
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be created
  + resource "aws_cognito_user_pool" "gaspi_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OPTIONAL"
      + name                       = "gaspi-users"
      + region                     = "ap-southeast-3"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                   = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + user_pool_tier             = (known after apply)

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + email_configuration {
          + configuration_set     = "ses-feedback-config"
          + email_sending_account = "DEVELOPER"
          + from_email_address    = "dian.larasaty@xapiens.id"
          + source_arn            = "arn:aws:ses:ap-southeast-3:438465168484:identity/dian.larasaty@xapiens.id"
        }

      + lambda_config {
          + custom_message       = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-customMessageLambdaTrigger"
          + pre_token_generation = (known after apply)

          + pre_token_generation_config (known after apply)
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "terraform"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + software_token_mfa_configuration {
          + enabled = true
        }

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client must be replaced
+/- resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
      + access_token_validity                         = 5
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = 3
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = 5
      + logout_urls                                   = (known after apply)
      + name                                          = "gaspi-users-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 2
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply) # forces replacement
      + write_attributes                              = (known after apply)
        # (1 unchanged attribute hidden)

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "hours"
        }
    }

  # module.cognito.aws_iam_role.admin_group_role will be updated in-place
  ~ resource "aws_iam_role" "admin_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-admin-group-role"
        name                  = "gaspi-admin-group-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_authenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_authenticated"
        name                  = "gaspi_authenticated"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_unauthenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "unauthenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_unauthenticated"
        name                  = "gaspi_unauthenticated"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.manager_group_role will be updated in-place
  ~ resource "aws_iam_role" "manager_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-manager-group-role"
        name                  = "gaspi-manager-group-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.cognito.aws_lambda_permission.customMessageLambdaTrigger must be replaced
-/+ resource "aws_lambda_permission" "customMessageLambdaTrigger" {
      ~ id                  = "SBeaconBackendAllowCustomMessageLambdaTriggerInvoke" -> (known after apply)
      ~ source_arn          = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_authorizer.pgxflow_user_pool_authorizer will be updated in-place
  ~ resource "aws_api_gateway_authorizer" "pgxflow_user_pool_authorizer" {
        id                               = "1h2hn3"
        name                             = "pgxflow-userpool-authorizer"
      ~ provider_arns                    = [
          - "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:StopNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendRegistrationEmail",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-annotations",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-variants",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-pricing-cache",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-saved-queries",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "pricing:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::438465168484:role/sbeacon_backend_sagemaker_jupyter_instance_role",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*",
              + "arn:aws:s3:::gaspi-metadata-20250619023048449900000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/private/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateCohortVCfs",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateReports",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-indexer",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-submitDataset",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-generateCohortVCfs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-generateCohortVCfs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_authorizer.beacon_user_pool_authorizer will be updated in-place
  ~ resource "aws_api_gateway_authorizer" "beacon_user_pool_authorizer" {
        id                               = "25479y"
        name                             = "sbeacon-userpool-authorizer"
      ~ provider_arns                    = [
          - "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.webgui.data.external.build will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build" {
      + id          = (known after apply)
      + program     = [
          + "python",
          + "build_and_hash.py",
        ]
      + query       = {
          + "api_endpoint_clinic"     = "https://d1gjgo11mz1ewf.cloudfront.net/prod/"
          + "api_endpoint_sbeacon"    = "https://d2ho17g62kz49c.cloudfront.net/prod/"
          + "base_range"              = "5000"
          + "build_command"           = "./node_modules/.bin/ng build --configuration production --subresource-integrity"
          + "build_destiation"        = "../webapp/dist/beacon-v2-ui/browser/"
          + "clinic_mode"             = "pgxflow"
          + "data_portal_bucket"      = "gaspi-dataportal-20250619023046541400000001"
          + "hub_name"                = "RSJPD"
          + "identity_pool_id"        = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
          + "install_command"         = "pnpm install"
          + "region"                  = "ap-southeast-3"
          + "user_pool_id"            = (known after apply)
          + "user_pool_web_client_id" = (known after apply)
          + "webapp_dir"              = "../webapp/"
        }
      + result      = (known after apply)
      + working_dir = "webgui/terraform-aws"
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "2598827130174904583" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "7f6d1dc7a4c9e2337517c1e1a35a29d073425bae" -> (known after apply)
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "4043815742362835550" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "7f6d1dc7a4c9e2337517c1e1a35a29d073425bae" -> (known after apply)
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-customMessageLambdaTrigger"
      ~ last_modified                  = "2025-06-19T02:32:33.639+0000" -> (known after apply)
      + source_code_hash               = "YbD7bnuh2V/JdWxRNgVbA6YUki4YMkQJdhNUUAeg4Go="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (deposed object 72e5cd9c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2700050535487884804" -> null
      - triggers = {
          - "filename"  = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip"
          - "timestamp" = "1750300212735586000"
        } -> null
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-logEmailDelivery"
      ~ last_modified                  = "2025-06-19T02:32:22.508+0000" -> (known after apply)
      + source_code_hash               = "6hEx/JIJU/fftD/D1rsWOPDnaRjtf0OcrWPNEhtrVCU="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendClinicJobEmail"
      ~ last_modified                  = "2025-06-19T02:32:39.196+0000" -> (known after apply)
      + source_code_hash               = "NYb4prJVAEwp9FA/wD7R6AxMa//oUenAEizWz4+WlXo="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
      ~ last_modified                  = "2025-06-19T02:32:28.064+0000" -> (known after apply)
      + source_code_hash               = "H4kHzrouNk7n89PszIm5g/h8turqrsK5ulEEeclED8I="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "FILE_LOCATION"   = "gaspi-dataportal-20250619023046541400000001"
              - "HTS_S3_HOST"     = "s3.ap-southeast-3.amazonaws.com"
              - "RESULT_DURATION" = "86400"
              - "USER_POOL_ID"    = "ap-southeast-3_wrRXa0JGY"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-admin:sbeacon-backend-admin-0"
        name        = "sbeacon-backend-admin-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cognito-idp:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:DescribeNotebookInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendRegistrationEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "hUYZOXz5LfsOscADhMv5drAakZ25psJabahgSvktclg="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "COGNITO_ADMIN_GROUP_NAME"             = "administrators"
              - "COGNITO_REGISTRATION_EMAIL_LAMBDA"    = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendRegistrationEmail"
              - "COGNITO_USER_POOL_ID"                 = "ap-southeast-3_wrRXa0JGY"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
             
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.